In [18]:
import os
import pandas as pd
import numpy as np

In [30]:
#建表
create_query_sql = """
select * from company;
"""
create_query = '.\SqlVS.exe test.db "' + create_query_sql + '"'
create_query = create_query.replace('\n',' ')
result = os.popen(create_query).readlines()
for i in range(len(result)):
    result[i] = result[i].split('|')
result = pd.DataFrame(result)
result

   0      1   2           3          4
0  1   Paul  32  California  20000.0\n
1  2  Allen  25       Texas  15000.0\n